function [signal_out,I_out,Q_out,phase] = mod_msk2(data,data_len,sample_number,Rb) 
 %MSK基带调制 
%************************************************************************** 
 % data              调制信号 
% data_len          码元个数 
% sample_number     每个码元采样点数 
% Rb                码元速率 
% signal_out        基带调制输出 
% I_out             I路输出 
% Q_out             Q路输出 
%************************************************************************** 
  
 % data_len = 10;                %码元个数 
% sample_number = 8;            %采样点数 
% Rb = 16000;                   %码元速率 
% data1 = randint(1,data_len); 
 % data = 2*data1-1;             %传输的序列 
 
Tb = 1/Rb;                      %码元时间 
fs = Rb*sample_number;          %采样速率 
 
 %-------------------------------------------------------------------------- 
%采样 
for i = 1:sample_number 
     data_sample(i:sample_number:data_len*sample_number) = data; 
 end 
 %************************************************************************** 
  
 %-------------------------------------------------------------------------- 
 %计算相位 
phase = zeros(1,data_len*sample_number); 
 phase(1) = data_sample(1) * pi/2/sample_number; 
 for i = 2:data_len*sample_number 
     phase(i) = phase(i-1) + data_sample(i-1) * pi/2/sample_number; 
 end 
 %************************************************************************** 
  
 %-------------------------------------------------------------------------- 
 %I/Q 
 I_out = cos(phase); 
 Q_out = sin(phase); 
 %************************************************************************** 
  
 %-------------------------------------------------------------------------- 
 %调制信号产生 
signal_out = I_out + j*Q_out; 
 %**************************************************************************
